Revit 2027 API
DocumentSaveToCentralProgressChangedEventArgs Class
 The event arguments used during the save to central phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSaveToCentralProgressChangedEventArgs : DataTransferProgressChangedEventArgs
Public Class DocumentSaveToCentralProgressChangedEventArgs
	Inherits DataTransferProgressChangedEventArgs
public ref class DocumentSaveToCentralProgressChangedEventArgs : public DataTransferProgressChangedEventArgs
type DocumentSaveToCentralProgressChangedEventArgs =
    class
        inherit DataTransferProgressChangedEventArgs
    end
The DocumentSaveToCentralProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
FailureDueToConflicts |  Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.
FinishedSize |  The transferred data size, in bytes, since the last time this event was raised.
(Inherited from DataTransferProgressChangedEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Location |  Full path of the central model which is to be operated.
(Inherited from WorksharedOperationProgressChangedEventArgs)
RetryTimes |  The number of times Revit has tried to Save to Central." Its value is '0' at the first time.
SaveToCentralFinished |  Indicates if current 'save to central' is finished.
Speed |  Speed(bytes/second) in this event.
(Inherited from DataTransferProgressChangedEventArgs)
Status |  Gets API event status, reflect current operation execution status.
(Inherited from WorksharedOperationProgressChangedEventArgs)
TotalSize |  Total expected data size to transfer, in bytes.
(Inherited from DataTransferProgressChangedEventArgs)
TransferMode |  Data transfer mode in this event.
(Inherited from DataTransferProgressChangedEventArgs)
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time. Name correction - it is renamed from 'DocumentSaveToCentralProgessChangedEventArgs' released since 2017 Subscription Update.
See Also
Reference
Autodesk.Revit.DB.Events Namespace